'''
Задание 16
Алгоритм вычисления значения функции F(n), где n – целое число,
 задан следующими соотношениями:
F(n) = 1, при n < 2,
F(n) = F(n/3) - 1, когда n ≥ 2 и делится на 3,
F(n) = F(n - 1) + 7, когда n ≥ 2 и не делится на 3.
Назовите количество значений n на отрезке [1;100000],
для которых F(n) равно 35.
'''
def f(n):
    if n<2:
        return 1
    elif n>=2 and n%3==0:
        return f(n/3)-1
    elif n>=2 and n%3!=0:
        return f(n-1)+7
k=0
for i in range(10,100000):
    if f(i)==35:
        k+=1
        print(i)
print(k)