#Определите наибольшее введённое значение переменной s, при котором программа выведет число 291.
for i in range (3000):
    s = i #nt(input())
    n = 121
    while s < 124:
      s = s + 10
      n = n + 17
    if n==291:
        print(i)