S='Каждый человек, которого я встречаю, \nв каком-то отношении превосходит меня, и в этом смысле я могу у него поучиться.'
# Массивы(списки) и строки в Python
# 1 Объявление и заполение
A=[]
B=[1,45,17,32,8]
c=["Привет", 'как', 'дела', 'скоро', 'лето', '2022',['июнь','июль','август']]
z=list(range(10))
у=[5]*10 # массив с 10ю Пятерками
# ввод списка в ручную
'''
for i in range(5):
    A[i]=input()
'''
# тоже самое только запись в стиле Python
A=[input() for i in range(10)]
print(c[1])
# вывод массива
print(A)

#вывод массива(списка) перебором
for i in range(len(B)):
    print(B[i])
for i in range(len(c)):
    print(c[i], end=" ")

#добавление элемента в конец списка
A.append(777)
#вставка элемента в список
A.insert(4,888)
print(A)
# удаление элемента их списка
A.pop(0)
print(A)

'''
стандартные задачи на списки( массивы)
 - поиск элемента в списке наибольшего/наименьшего - определенного - посчитать сколько
 - сортировка списка
'''

# Строки
s1='Всегда кажется, что нас любят за то, что мы хороши.'
s2='А не догадываемся, что любят нас оттого, что хороши те, кто нас любит.'
# склейка строк
s3=s1+s2
print(s3)
print(s1[2])
# перебор строки
for i in range(len(s1)):
    print(s1[i])
# поиск в строке
n=s1.find('любят')
print(n)
# вхождение в сроку
m=s3.count('o')
print(m)
# замена в строке
s4=s3.replace('о','ооо')
print(s4)
# срезы строк
print(s2[:10])
'''
задания для самостоятельного выполнения
массивы(списки)
0. перечислить операции осуществляемые со списками и функции работающие со спискаи; перечтслить операции со строками и функции работы со строками
1. заполнить список на 10 элементов вводом с клавиатуры (числа), вывести на экран в строку, каждый элемент через пробел;
 найти и вывести наибольший элемент и его номер в списке
2. заполнить список список на 50 эелементов случайными числамииз диапзона -100:100 и составить алгоритм поиска ниименьшего элемента
3. ввести с клавиатуры стороку составить алгоритм находящий и сообщающий сколько введеннойстроке пробелов
4. ввети строку  составить алгоритм заменяющий введеннойтроке буквы "о" на 0 и буквы "ч" на 4
'''
