# o=0
# br=0
# for i in range(10,1000):
#     s=str(i)
#     br=0
#     for o in range (len(s)-1):
#         if s[o]<s[o+1]:
#             br+=1
#     if br>0:
#         continue
#     x = i
#     x = (x - x % 8) * 10
#     a = 1
#     b = 0
#     while x > 0:
#         if x % 2 != 0:
#             a = a * (x % 4)
#         else:
#             b = b + (x % 4)
#             x = x // 8
#     print(a)
#     print(b)
print('Привет, Яндекс!\nПриятно познакомиться.')
'''Эхо-1
Kлассная работа
макс. 1 балл.
Ограничение времени	1 секунда
Ограничение памяти	64Mb
Ввод	стандартный ввод или input.txt
Вывод	стандартный вывод или output.txt
Напишите программу, которая выводит «Ауууу!» два раза (на отдельных строках; строки должны быть именно такие, символ в символ!).

Совет: поместите эту строку в переменную и выводите уже эту переменную.'''
s = 'Ауууууу!'
print(s)
print(s)
'''Телефон
Kлассная работа
макс. 1 балл.
Ограничение времени	1 секунда
Ограничение памяти	64Mb
Ввод	стандартный ввод или input.txt
Вывод	стандартный вывод или output.txt
Напишите программу, которая передает дальше все, что получила.

Формат ввода
Вводится три строки.

Формат вывода
Выведите их в том же порядке, каждую с новой строки.
Используйте присваивание.

Пример 1
Ввод	Вывод
Алло!
Кто говорит?
Слон?
Алло!
Кто говорит?
Слон?
Пример 2
Ввод	Вывод
Неужели
В самом деле
Все сгорели карусели?
Неужели
В самом деле
Все сгорели карусели?
'''
#s1 = input()
#s2 = input()
#s3 = input()
#print(s1)
#print(s2)
#print(s3)

'''Килобайты
Kлассная работа
макс. 2 балл.
Ограничение времени	1 секунда
Ограничение памяти	64Mb
Ввод	стандартный ввод или input.txt
Вывод	стандартный вывод или output.txt
Чем отличается начинающий программист от опытного?
Начинающий считает, что в килобайте 1000 байт,
а опытный – что в километре 1024 метра.

Напишите программу, которая поможет перевести 15 килобайт в байты и биты, а заодно напомнит, 
как переводятся единицы измерения информации.
Программа сначала печатает краткую табличку перевода, а затем правильный ответ.

Нужно вывести справочную таблицу, а в последней строке ответ по образцу:

1 бит - наименьшая единица измерения информации.
1 байт = 8 бит
1 Кбайт = 1024 байт
ХХХХ Кбайт = YYYY байт = ZZZZ бит

где вместо XXXX стоит число 15, а вместо YYYY и ZZZZ перевод в байты и биты соответственно.

Примечания
Вы не должны считать значения на калькуляторе, запишите формулу, программа сама все посчитает. 
И вспомните, как выводить несколько значений через пробел.'''
a = 15
print('1 бит - наименьшая единица измерения информации.\n1 байт = 8 бит\n1 Кбайт = 1024 байт\n', a, ' Кбайт = ',
      a * 1024, ' байт = ', a * 1024 * 8, ' бит', sep='')

'''Загадка
Kлассная работа
макс. 1 балл.
Ограничение времени	1 секунда
Ограничение памяти	64Mb
Ввод	стандартный ввод или input.txt
Вывод	стандартный вывод или output.txt
Представьте, что вы играете в игру с компьютером, в которой он загадывает слово, например, месяц года, а вы должны угадать, какой месяц был загадан. Проигрывать не хочется, поэтому попробуем немного изменить программу компьютера, чтобы он сам подсказывал нам правильный ответ. Не нужно разбираться в коде программы, он пока во многом непонятен. Придумайте только одну строку, которую нужно записать в указанное место, чтобы компьютер подсказывал загаданное слово.
Вот код программы:
import random  
 
months = ["январь", "февраль", "март", "апрель",  
          "май", "июнь", "июль", "август", "сентябрь",  
          "октябрь", "ноябрь", "декабрь"]  
secret = random.choice(months)  
# ВЫШЕ НЕПОНЯТНЫЙ КОД!  
# сейчас в переменной secret лежит загаданный месяц  
### В следующую строку нужно записать решение!  
 
### В предыдущую строку нужно записать решение!  
print("Какой месяц я загадал?")  
solution = input()  
# НИЖЕ НЕПОНЯТНЫЙ КОД!  
# тут программа проверяет, совпал ли ответ с загаданным словом  
if secret == solution:  
    print("Точно!")  
elif solution not in months:  
    print("Это слово вообще не месяц!")  
else:  
    print("Не угадал!")  
В тестирующую систему сдайте только одну строку!'''
print(secret)



















