''''Рита составляет 4-буквенные слова из букв П, С, К, А, Л, Ь, причём мягкий знак,
если встречается, не может стоять в начале слова, а также рядом с ещё одним мягким знаком.
 Буквы в слове могут повторяться.
 Сколько таких слов может составить Рита?'''
k=0
for q in 'ПСКАЛ':
    for w in 'ПСКАЛЬ':
        for e in 'ПСКАЛЬ':
            for r in 'ПСКАЛЬ':
                s=q+w+e+r
                if s.count('Ь')==2:
                    if s[1] == 'Ь' and s[2] != 'Ь':
                        k += 1
                    elif s[2]=='Ь' and s[1]!='Ь' and s[3]!='Ь':
                        k+=1
                    elif s[3]=='Ь'  and s[2]!='Ь':
                        k+=1
                elif s.count('Ь')==3:
                    k+=0
                else:
                    k+=1
                print(k,s)

print(k)
#for q in 'ПСКАЛ':
#    for w in 'ПСКАЛ':
#        for e in 'ПСКАЛЬ':
#            for r in 'ПСКАЛ':
#                s=q+w+e+r
#
#                k+=1
#
#print(k)
#