'''
Значение выражения 71003 + 6∙71104 – 3∙757 + 294 записали в системе счисления с основанием 7.
Найдите сумму цифр получившегося числа и запишите её в ответе в десятичной системе счисления.
'''
i= 7**1003 + 6*7**1104 - 3*7**57 + 294
ss=''
while i>0:
    s=i%7
    ss=str(s)+ss
    i=i//7
print(ss)
k=0
for u in ss:
    k+=int(u)
print(k)
