'''Значение выражения 4503 + 3∙4244 – 2∙4444 – 95 записали в системе счисления с основанием 4.
Сколько цифр 3 содержится в этой записи?
'''
s=4**503+3*4**244-2*4**444-95
s1=''
while s>0:
    a=s%4
    s = s // 4
    s1=str(a)+s1
print (s1)
print (s1.count('3'))