'''
Значение выражения 7**1003 + 6∙7**1104 – 3∙7**57 + 294 записали в системе счисления с основанием 7.
Найдите сумму цифр получившегося числа и запишите её в ответе в десятичной системе счисления.
'''
s=7**1003+6*7**1104-3*7**57+294
print(s)
s1=''
while s>0:
    a=s%7
    s=s//7
    s1=str(a)+s1
print (s1)
ss=0
for i in s1:
    ss=ss+int(i)
print (ss)