''' Значение выражения (7160 • 790) – (14150 + 213)
записали в системе счисления с основанием 7.
Найдите сумму всех цифр семеричной записи числа,
 исключая шестерки.'''
n=((7**160 * 7**90)-(14**150 + 2**13))
h=0
g=''
while n > 0:
    h=n%7
    g=str(h)+g
    n=n//7
print(g)
s=0
for i in g:
    if int(i)!=6:
        s+=int(i)
print(s)