'''
Задание 16
(Е. Джобс) Алгоритм вычисления значения функции F(n), где n – целое число, задан следующими соотношениями:
F(n) = n + 3, при n ≤ 3
F(n) = F(n – 2) + n, при n > 3 и четном значении F(n-1),
F(n) = F(n – 2) + 2•n, при n > 3 и нечетном значении F(n-1).
Определите сумму значений, являющихся результатом вызова функции для значений n в диапазоне [40; 50].
'''
def F(n):
    if n<4:
        return n+3
    if n>3 and F(n-1)%2==0:
        return F(n-2)+n
    if n>3 and F(n-1)%2!=0:
        return F(n-2)+2*n

print(F(40))