'''
Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча камней. Игроки ходят по очереди, первый ход
делает Петя. За один ход игрок может добавить в кучу один камень, добавить два камня или увеличить количество камней в куче в три раза.
При этом нельзя повторять ход, который только что сделал второй игрок. Например, если в начале игры в куче 4 камня,
Петя может первым ходом получить кучу из 5, 6 или 12 камней. Если Петя добавил 1 камень и получил кучу из 5 камней,
то следующим ходом Ваня может либо добавить 2 камня (и получить 7 камней), либо утроить количество камней в куче (их станет 15).
Получить 6 камней Ваня не может, так как для этого нужно добавить 1 камень, а такой ход только что сделал Петя.
Чтобы делать ходы, у каждого игрока есть неограниченное количество камней.
Игра завершается, когда количество камней в куче становится не менее 140. Победителем считается игрок, сделавший последний ход,
то есть первым получивший кучу, в которой будет 140 или больше камней. В начальный момент в куче было S камней, 1 ≤ S ≤ 139.
Ответьте на следующие вопросы:
  Вопрос 1. Укажите такое значение S, при котором Петя не может выиграть за один ход, но при любом ходе Пети Ваня может выиграть своим первым ходом.
  Вопрос 2. Определите, минимальное и максимальное значения S, при которых у Пети есть выигрышная стратегия, причём
  одновременно выполняются два условия:
− Петя не может выиграть за один ход;
− Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
Найденные значения запишите в ответе в порядке возрастания.
  Вопрос 3. Найдите значение S, при котором одновременно выполняются два условия:
– у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
– у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.
'''
print("Задание 19")
def f(a,n):
    if a>=29 or n>2:
        return n==2
    if n%2==0:# Был ход вани - противник совершает ход
        return all([f(a+1,n+1),f(a*2,n+1)])
    return any([f(a + 1, n + 1), f(a * 2, n + 1)])

for i in range(1,28):
    if f(i,0):
        print(i)
print(' Задание 20')

def f(a,n):
    if a>=29 or n>3:#2->3
        return n==3#2->3
    if n%2==1: #0->1         # Был ход вани - противник совершает ход
        return all([f(a+1,n+1),f(a*2,n+1)])
    return any([f(a + 1, n + 1), f(a * 2, n + 1)])

print(' Задание 21')
for i in range(1,28):
    if f(i,0):
        print(i)


def f(a,n):
    if a>=29 or n>2:#2-> если не долженвыйграть вторым своим ходом иначе 4
        return n==2 or n==4#2->3
    if n%2==0: #0<->1         # Был ход вани - противник совершает ход
        return all([f(a+1,n+1),f(a*2,n+1)])
    return any([f(a + 1, n + 1), f(a * 2, n + 1)])

for i in range(1,28):
    if f(i,0):
        print(i)




















