'''
(№ 4181) (Е. Джобс) Два игрока, Петя и Ваня, играют в следующую игру. У игроков есть табличка,
на которой записана пара неотрицательных целых чисел. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может заменить любое число на сумму обоих чисел. Так, например, если перед ходом игрока была позиция (3, 5), то после его хода будет позиция (8, 5) или (3, 8). Игра завершается в тот момент, когда сумма чисел пары становится не менее 45. Победителем считается игрок, сделавший последний ход.
Ответьте на следующие вопросы:
  Вопрос 1. Известно, что игра началась в позиции (7, S), при этом Ваня одержал победу после неудачного хода Пети.
  Укажите минимальное значение S, при котором это возможно.
  Вопрос 2. Найдите значения S, при которых Петя при правильной игре гарантированно выигрывает своим вторым ходом
   из позиции (6, S). В качестве ответа укажите сначала минимальное, затем максимальное значение.
  Вопрос 3. Известно, что при игре из позиции (S, S) Ваня гарантированно выигрывает своим вторым ходом при любой игре Пети.
   Найдите минимальное значение S, при котором это возможно.

print("Задание 19")
def f(a,b,n):
    if a+b>=45 or n>2:
        return n==2
    if n%2==0:# Был ход вани - противник совершает ход
        return any([f(a+b,b,n+1),f(a,a+b,n+1)])
    return any([f(a+b,b,n+1),f(a,a+b,n+1)])

for i in range(1,45):
    if f(7,i,0):
        print(i)
        break

print("Задание 20")
def f(a,b,n):
    if a+b>=45 or n>3:
        return n==3
    if n%2==1:# Был ход вани - противник совершает ход
        return all([f(a+b,b,n+1),f(a,a+b,n+1)])
    return any([f(a+b,b,n+1),f(a,a+b,n+1)])

for i in range(1,45):
    if f(6,i,0):
        print(i)

print("Задание 21")
def f(a,b,n):
    if a+b>=45 or n>4:
        return n==2 or n==4
    if n%2==0:# Был ход вани - противник совершает ход
        return all([f(a+b,b,n+1),f(a,a+b,n+1)])
    return any([f(a+b,b,n+1),f(a,a+b,n+1)])

for i in range(1,45):
    if f(i,i,0):
        print(i)
        break

print('Задание 19')
def game(s,h ):
  if s>=129 or h>2:
    return h==2
  if h%2==0:#Проверка хода Пети
    return game(s+1,h+1) and game(s+3,h+1) and game(s*4,h+1)
  return game(s+1,h+1) or game(s+3,h+1) or game(s*4,h+1)
for s in range(1,129):
  if game(s,0):
    print(s)

print('Задание 20')
def game(s,h ):
  if s>=129 or h>3:
    return h==3
  if h%2!=0:#Проверка хода Ваня
    return game(s+1,h+1) and game(s*2,h+1)
  return game(s+1,h+1) or game(s*2,h+1)
for s in range(1,129):
  if game(s,0):
    print(s)

print('Задание 21')
def game(s,h ):
  if s>=129 or h>4:
    return h==4 or h==2
  if h%2==0:#Проверка хода Петя
    return game(s+1,h+1) and game(s*2,h+1)
  return game(s+1,h+1) or game(s*2,h+1)
for s in range(1,129):
  if game(s,0):
    print(s)

(№ 6769) (ЕГЭ-2023) Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может добавить в кучу один или три камня или увеличить количество камней в куче в четыре раза. Чтобы делать ходы, у каждого игрока есть неограниченное количество камней. Игра завершается, когда количество камней в куче становится не менее 111. Победителем считается игрок, сделавший последний ход, то есть первым получивший кучу, в которой будет 111 или больше камней. В начальный момент в куче было S камней, 1 ≤ S ≤ 110.
Ответьте на следующие вопросы:
  Вопрос 1. Найдите такое значение S, при котором Петя не может выиграть за один ход, но Ваня выигрывает своим первым ходом после любого хода Пети.
  Вопрос 2. Найдите два наименьших значения S, когда Петя имеет выигрышную стратегию, причём одновременно выполняются два условия:
− Петя не может выиграть за один ход;
− Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
Найденные значения запишите в ответе в порядке возрастания.
  Вопрос 3. Найдите наименьшее значение S, при котором одновременно выполняются два условия:
– у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
– у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.
ответ
1) 27
2) 24 26
3) 23'''
print("Задание 19")
def f(s,n):
    if s>=111 or n>2:
        return n==2
    if n%2==0:# Был ход вани - противник совершает ход
        return any([f(s+1,n+1),f(s+3,n+1),f(s*4,n+1)])
    return any([f(s+1,n+1),f(s+3,n+1),f(s*4,n+1)])

for i in range(1,111):
    if f(i,0):
        print(i)

