#Алгоритм получает на вход натуральное
#число N > 1 и строит по нему новое число R следующим образом:
#1. Вычисляется сумма чётных цифр в десятичной записи числа N.
#Если чётных цифр в записи нет, сумма считается равной нулю.
#2. Вычисляется сумма цифр, стоящих на чётных местах в десятичной записи числа А без ведущих нулей.
#Места отсчитываются слева направо (от старших разрядов к младшим, начиная с единицы).
#Если число однозначное (цифр на чётных местах нет), сумма считается равной нулю.
#3. Результатом работы алгоритма становится модуль разности полученных двух сумм.
for n in range(10000):
    b=str(n)
    s1=0
    for i in b:
        if int(i)%2==0:
            s1+=int(i)
    s2=0
    if len(b)<1:
        s2=0
    else:
        for i in range(1,len(b),2):
            s2 += int(b[i])
    if abs(s1-s2)==13:
        print(n)
