'''
Задание 5
На вход алгоритма подаётся натуральное число N.
Алгоритм строит по нему новое число R следующим образом.
1) Строится двоичная запись числа N.
2) Затем справа дописываются два разряда: символы 01,
если число N чётное, и 10, если нечётное.
Полученная таким образом запись (в ней на два разряда
больше, чем в записи исходного числа N) является двоичной
записью искомого числа R. Укажите минимальное число R, большее 81,
которое может являться результатом работы этого алгоритма.
В ответе это число запишите в десятичной системе.
'''
for n in range (100):
    r=bin(n)[2:]
    #print (r)
    if n%2==0:
        r=r+'01'
    else:
        r=r+'10'
    print('n=',n,'r=',int(r,2))