'''
Иван составляет 5-буквенные коды из букв И, В, А, Н.
Буквы в коде могут повторяться, использовать все буквы не обязательно,
но букву И нужно использовать хотя бы один раз.
Сколько различных кодов может составить Иван?
'''
#s= ['И','В','А','Н']
k=0
for a1 in 'ИВАН':
    for a2 in 'ИВАН':
        for a3 in 'ИВАН':
            for a4 in 'ИВАН':
                for a5 in 'ИВАН':
                    s=a1+a2+a3+a4+a5
                    print(s)
                    if s.count('И')!=0:
                        k+=1
print(k)