'''
Задание 8
(А. Куканова) Марта составляет 6-буквенные слова из букв И, Н, Ф, А,
причём буква Ф должна встречаться в слове ровно 2 раза.
Остальные буквы могут встречаться любое количество раз или не встречаться вообще.
Сколько слов может составить Марта?
'''
s=['И','Н','Ф','А']
k=0
for a in s:
    for b in s:
        for c in s:
            for d in s:
                for e in s:
                    for f in s:
                        z=a+b+c+d+e+f
                        if z.count('Ф')==2:
                            k+=1
                            print (z)
print (k)