'''(№ 6769) (ЕГЭ-2023) Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча камней.
Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может добавить в кучу один или три камня
или увеличить количество камней в куче в четыре раза. Чтобы делать ходы, у каждого игрока есть неограниченное
 количество камней. Игра завершается, когда количество камней в куче становится не менее 111. Победителем
 считается игрок, сделавший последний ход, то есть первым получивший кучу, в которой будет 111 или больше
 камней. В начальный момент в куче было S камней, 1 ≤ S ≤ 110.
Ответьте на следующие вопросы:
  Вопрос 1. Найдите такое значение S, при котором Петя не может выиграть за один ход, но Ваня выигрывает своим
   первым ходом после любого хода Пети.
  Вопрос 2. Найдите два наименьших значения S, когда Петя имеет выигрышную стратегию, причём одновременно выполняются два условия:
− Петя не может выиграть за один ход;
− Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
Найденные значения запишите в ответе в порядке возрастания.
  Вопрос 3. Найдите наименьшее значение S, при котором одновременно выполняются два условия:
– у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
– у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.
ответ
1) 27
2) 24 26
3) 23'''
#print("Задание 19")
#def f(s,n):
#    if s>=111 or n>2:
#        return n==2
#    if n%2==0:# Был ход вани - противник совершает ход
#        return all([f(s+1,n+1),f(s+3,n+1),f(s*4,n+1)])
#    return any([f(s+1,n+1),f(s+3,n+1),f(s*4,n+1)])
#
#for i in range(1,111):
#    if f(i,0):
#        print(i)
#
#print("Задание 20")
#def f(s,n):
#    if s>=111 or n>3:
#        return n==3
#    if n%2!=0:# Был ход вани - противник совершает ход
#        return all([f(s+1,n+1),f(s+3,n+1),f(s*4,n+1)])
#        #      f(s+1,n+1) and f(s+3,n+1) and f(s*4,n+1)
#    return any([f(s+1,n+1),f(s+3,n+1),f(s*4,n+1)])
#        #      f(s+1,n+1) or f(s+3,n+1) or f(s*4,n+1)
#
#for i in range(1,111):
#    if f(i,0):
#        print(i)
#
#print("Задание 21")
#def f(s,n):
#    if s>=111 or n>4:
#        return n==4 or n==2
#    if n%2==0:# Был ход вани - противник совершает ход
#        return all([f(s+1,n+1),f(s+3,n+1),f(s*4,n+1)])
#    return any([f(s+1,n+1),f(s+3,n+1),f(s*4,n+1)])
#
#for i in range(1,111):
#    if f(i,0):
#        print(i)

'''(№ 5376) (ЕГЭ-2022) Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежат две кучи камней. 
Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может добавить в одну из куч (по своему выбору) 
один камень или увеличить количество камней в куче в два раза. Для того чтобы делать ходы, у каждого игрока 
есть неограниченное количество камней. Игра завершается в тот момент, когда суммарное количество камней в кучах 
становится не менее 259. Победителем считается игрок, сделавший последний ход, т.е. первым получивший такую позицию,
 при которой в кучах будет 259 или больше камней. В начальный момент в первой куче было 17 камней,
 во второй куче – S камней; 1 ≤ S ≤ 241.
Ответьте на следующие вопросы:
  Вопрос 1. Известно, что Ваня выиграл своим первым ходом после неудачного первого хода Пети. 
  Укажите минимальное значение S, когда такая ситуация возможна.
  Вопрос 2. Найдите два наименьших значения S, при которых у Пети есть выигрышная стратегия, причём одновременно 
  выполняются два условия:
− Петя не может выиграть за один ход;
− Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
Найденные значения запишите в ответе в порядке возрастания.
  Вопрос 3. Найдите минимальное значение S, при котором одновременно выполняются два условия:
– у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
– у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.
1) 61
2) 112 120
3) 111'''
print("Задание 19")
def f(a,b,n):
    if a+b>=259 or n>2:
        return n==2
    if n%2==0:# Был ход вани - противник совершает ход
        return  f(a+1,b,n+1) and f(a*2,b,n+1) and f(a,b+1,n+1) and f(a,b*2,n+1)
    return  f(a+1,b,n+1) or f(a*2,b,n+1) or f(a,b+1,n+1) or f(a,b*2,n+1)

for i in range(1,242):
    if f(17,i,0):
        print(i)


print("Задание 20")
def f(a,b,n):
    if a+b>=259 or n>3:
        return n==3
    if n%2!=0:# Был ход вани - противник совершает ход
        return  f(a+1,b,n+1) and f(a*2,b,n+1) and f(a,b+1,n+1) and f(a,b*2,n+1)
    return  f(a+1,b,n+1) or f(a*2,b,n+1) or f(a,b+1,n+1) or f(a,b*2,n+1)

for i in range(1,242):
    if f(17,i,0):
        print(i)

print("Задание 21")
def f(a,b,n):
    if a+b>=259 or n>4:
        return n==4 or n==2
    if n%2==0:# Был ход вани - противник совершает ход
        return  f(a+1,b,n+1) and f(a*2,b,n+1) and f(a,b+1,n+1) and f(a,b*2,n+1)
    return  f(a+1,b,n+1) or f(a*2,b,n+1) or f(a,b+1,n+1) or f(a,b*2,n+1)

for i in range(1,242):
    if f(17,i,0):
        print(i)


